{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": [],
      "authorship_tag": "ABX9TyNYxDAbbwaiOQT77fxAZnz0",
      "include_colab_link": true
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "view-in-github",
        "colab_type": "text"
      },
      "source": [
        "<a href=\"https://colab.research.google.com/github/shreyassathyamangalam/ai_projects/blob/main/Neo4j_Graphiti_KG.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Install Dependencies"
      ],
      "metadata": {
        "id": "wFpYYwpbFCAE"
      }
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "AWRr6TsJEyoa",
        "outputId": "6eadc685-4418-4fff-c157-3eb881de53ef"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "\u001b[?25l   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m0.0/172.3 kB\u001b[0m \u001b[31m?\u001b[0m eta \u001b[36m-:--:--\u001b[0m\r\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m172.3/172.3 kB\u001b[0m \u001b[31m11.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25h\u001b[?25l   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m0.0/45.5 kB\u001b[0m \u001b[31m?\u001b[0m eta \u001b[36m-:--:--\u001b[0m\r\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m45.5/45.5 kB\u001b[0m \u001b[31m3.6 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25h\u001b[?25l   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m0.0/325.8 kB\u001b[0m \u001b[31m?\u001b[0m eta \u001b[36m-:--:--\u001b[0m\r\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m325.8/325.8 kB\u001b[0m \u001b[31m21.4 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25h\u001b[?25l   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m0.0/144.5 kB\u001b[0m \u001b[31m?\u001b[0m eta \u001b[36m-:--:--\u001b[0m\r\u001b[2K   \u001b[90m━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━\u001b[0m \u001b[32m144.5/144.5 kB\u001b[0m \u001b[31m10.9 MB/s\u001b[0m eta \u001b[36m0:00:00\u001b[0m\n",
            "\u001b[?25h\u001b[31mERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.\n",
            "google-adk 1.17.0 requires tenacity<9.0.0,>=8.0.0, but you have tenacity 9.1.2 which is incompatible.\u001b[0m\u001b[31m\n",
            "\u001b[0m"
          ]
        }
      ],
      "source": [
        "!pip install -q -U graphiti-core"
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Connection setup"
      ],
      "metadata": {
        "id": "XGhyKZXSFtzP"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "import os\n",
        "from google.colab import userdata\n",
        "os.environ['OPENAI_API_KEY'] = userdata.get('OPENAI_API_KEY')\n",
        "\n",
        "neo4j_uri=\"neo4j+s://1d531fab.databases.neo4j.io\"\n",
        "neo4j_username=\"neo4j\"\n",
        "neo4j_password=\"mFkMTEbJV1fsfl3xpr42udGQl2jXCDTy_gxPAfYsVFc\"\n",
        "neo4j_database=\"neo4j\""
      ],
      "metadata": {
        "id": "HtYl3s_DFf7l"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "import asyncio\n",
        "import json\n",
        "from datetime import datetime, timezone\n",
        "\n",
        "from graphiti_core import Graphiti\n",
        "from graphiti_core.nodes import EpisodeType\n",
        "from graphiti_core.search.search_config_recipes import NODE_HYBRID_SEARCH_RRF\n",
        "from graphiti_core.utils.maintenance.graph_data_operations import clear_data"
      ],
      "metadata": {
        "id": "vKHsK4mTGYVM"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "import nest_asyncio, asyncio\n",
        "nest_asyncio.apply()"
      ],
      "metadata": {
        "id": "uq5r4_kNH0vc"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "## Initialize Graphiti with Neo4J Connection"
      ],
      "metadata": {
        "id": "crhTBBlQIW_F"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "graphiti = Graphiti(neo4j_uri, neo4j_username, neo4j_password)\n",
        "\n",
        "# Initialize the graph database with graphiti's indices. This only needs to be done once.\n",
        "# Note: This will clear the database\n",
        "\n",
        "await clear_data(graphiti.driver)\n",
        "await graphiti.build_indices_and_constraints()"
      ],
      "metadata": {
        "id": "-bGPoDBXH9RY"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "markdown",
      "source": [
        "https://help.getzep.com/graphiti/core-concepts/adding-episodes"
      ],
      "metadata": {
        "id": "4brHT4xoKJ9L"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "episodes = [\n",
        "    {\n",
        "        \"name\": \"About Me\",\n",
        "        \"content\": \"Hi, I'm Shreyas. I'm learning how to build Knowledge Graphs\",\n",
        "        \"type\": EpisodeType.text,\n",
        "        \"description\": \"intro\"\n",
        "    },\n",
        "    {\n",
        "        \"name\": \"About my Knowledge Graphs\",\n",
        "        \"content\": \"Knowledge Graphs facinate me\",\n",
        "        \"type\": EpisodeType.text,\n",
        "        \"description\": \"overview\"\n",
        "    }\n",
        "]"
      ],
      "metadata": {
        "id": "aIXnDSt_JOha"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "async def add_data(episodes):\n",
        "  \"\"\"Add Episodes to the graph\"\"\"\n",
        "  for episode in episodes:\n",
        "    if episode[\"type\"] == EpisodeType.json:\n",
        "      episode[\"content\"] = json.dumps(episode[\"content\"])\n",
        "\n",
        "    await graphiti.add_episode(\n",
        "        name=episode[\"name\"],\n",
        "        episode_body=episode[\"content\"],\n",
        "        source=episode[\"type\"],\n",
        "        source_description=episode[\"description\"],\n",
        "        reference_time=datetime.now(timezone.utc)\n",
        "        )\n",
        "    print(f\"Added episode {episode['name']}\")"
      ],
      "metadata": {
        "id": "r4p9-EhaLrtx"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "await add_data(episodes)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "gyJtB3ZvNEKb",
        "outputId": "f6a1253d-86b4-4933-f411-79da31451d70"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stderr",
          "text": [
            "WARNING:neo4j.notifications:Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `entity_edges` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=17, column=7, offset=473>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 473, 'line': 17, 'column': 7}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n                                    MATCH (e:Episodic)\\n                                    WHERE e.valid_at <= $reference_time\\n                                    \\nAND e.group_id IN $group_ids\\nAND e.source = $source\\n        RETURN\\n        \\n    e.uuid AS uuid,\\n    e.name AS name,\\n    e.group_id AS group_id,\\n    e.created_at AS created_at,\\n    e.source AS source,\\n    e.source_description AS source_description,\\n    e.content AS content,\\n    e.valid_at AS valid_at,\\n    e.entity_edges AS entity_edges\\n\\n        ORDER BY e.valid_at DESC\\n        LIMIT $num_episodes\\n        '\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `name_embedding` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=4, column=48, offset=314>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 314, 'line': 4, 'column': 48}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n                                                                                                                            MATCH (n:Entity)\\n                                                                                                                            \\n            WITH n, vector.similarity.cosine(n.name_embedding, $search_vector) AS score\\n            WHERE score > $min_score\\n            RETURN\\n            \\n        n.uuid AS uuid,\\n        n.name AS name,\\n        n.group_id AS group_id,\\n        n.created_at AS created_at,\\n        n.summary AS summary,\\n        labels(n) AS labels,\\n        properties(n) AS attributes\\n    \\n            ORDER BY score DESC\\n            LIMIT $limit\\n            '\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `name_embedding` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=4, column=48, offset=314>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 314, 'line': 4, 'column': 48}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n                                                                                                                            MATCH (n:Entity)\\n                                                                                                                            \\n            WITH n, vector.similarity.cosine(n.name_embedding, $search_vector) AS score\\n            WHERE score > $min_score\\n            RETURN\\n            \\n        n.uuid AS uuid,\\n        n.name AS name,\\n        n.group_id AS group_id,\\n        n.created_at AS created_at,\\n        n.summary AS summary,\\n        labels(n) AS labels,\\n        properties(n) AS attributes\\n    \\n            ORDER BY score DESC\\n            LIMIT $limit\\n            '\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `episodes` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=13, column=11, offset=372>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 372, 'line': 13, 'column': 11}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n            MATCH (n:Entity {uuid: $source_node_uuid})-[e:RELATES_TO]->(m:Entity {uuid: $target_node_uuid})\\n        \\n            RETURN\\n            \\n        e.uuid AS uuid,\\n        n.uuid AS source_node_uuid,\\n        m.uuid AS target_node_uuid,\\n        e.group_id AS group_id,\\n        e.created_at AS created_at,\\n        e.name AS name,\\n        e.fact AS fact,\\n        e.episodes AS episodes,\\n        e.expired_at AS expired_at,\\n        e.valid_at AS valid_at,\\n        e.invalid_at AS invalid_at,\\n    properties(e) AS attributes'\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `fact_embedding` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=4, column=63, offset=148>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 148, 'line': 4, 'column': 63}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (n:Entity)-[e:RELATES_TO]->(m:Entity)\\n     WHERE e.uuid in $edge_uuids\\n            WITH DISTINCT e, n, m, vector.similarity.cosine(e.fact_embedding, $search_vector) AS score\\n            WHERE score > $min_score\\n            RETURN\\n            \\n        e.uuid AS uuid,\\n        n.uuid AS source_node_uuid,\\n        m.uuid AS target_node_uuid,\\n        e.group_id AS group_id,\\n        e.created_at AS created_at,\\n        e.name AS name,\\n        e.fact AS fact,\\n        e.episodes AS episodes,\\n        e.expired_at AS expired_at,\\n        e.valid_at AS valid_at,\\n        e.invalid_at AS invalid_at,\\n    properties(e) AS attributes\\n            ORDER BY score DESC\\n            LIMIT $limit\\n            '\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `episodes` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=15, column=11, offset=480>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 480, 'line': 15, 'column': 11}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (n:Entity)-[e:RELATES_TO]->(m:Entity)\\n     WHERE e.uuid in $edge_uuids\\n            WITH DISTINCT e, n, m, vector.similarity.cosine(e.fact_embedding, $search_vector) AS score\\n            WHERE score > $min_score\\n            RETURN\\n            \\n        e.uuid AS uuid,\\n        n.uuid AS source_node_uuid,\\n        m.uuid AS target_node_uuid,\\n        e.group_id AS group_id,\\n        e.created_at AS created_at,\\n        e.name AS name,\\n        e.fact AS fact,\\n        e.episodes AS episodes,\\n        e.expired_at AS expired_at,\\n        e.valid_at AS valid_at,\\n        e.invalid_at AS invalid_at,\\n    properties(e) AS attributes\\n            ORDER BY score DESC\\n            LIMIT $limit\\n            '\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `episodes` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=15, column=11, offset=510>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 510, 'line': 15, 'column': 11}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: 'CALL db.index.fulltext.queryRelationships(\"edge_name_and_fact\", $query, {limit: $limit})\\n    YIELD relationship AS rel, score\\n    MATCH (n:Entity)-[e:RELATES_TO {uuid: rel.uuid}]->(m:Entity)\\n     WHERE e.uuid in $edge_uuids\\n            WITH e, score, n, m\\n            RETURN\\n            \\n        e.uuid AS uuid,\\n        n.uuid AS source_node_uuid,\\n        m.uuid AS target_node_uuid,\\n        e.group_id AS group_id,\\n        e.created_at AS created_at,\\n        e.name AS name,\\n        e.fact AS fact,\\n        e.episodes AS episodes,\\n        e.expired_at AS expired_at,\\n        e.valid_at AS valid_at,\\n        e.invalid_at AS invalid_at,\\n    properties(e) AS attributes\\n            ORDER BY score DESC\\n            LIMIT $limit\\n            '\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `episodes` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=15, column=11, offset=482>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 482, 'line': 15, 'column': 11}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: 'CALL db.index.fulltext.queryRelationships(\"edge_name_and_fact\", $query, {limit: $limit})\\n    YIELD relationship AS rel, score\\n    MATCH (n:Entity)-[e:RELATES_TO {uuid: rel.uuid}]->(m:Entity)\\n    \\n            WITH e, score, n, m\\n            RETURN\\n            \\n        e.uuid AS uuid,\\n        n.uuid AS source_node_uuid,\\n        m.uuid AS target_node_uuid,\\n        e.group_id AS group_id,\\n        e.created_at AS created_at,\\n        e.name AS name,\\n        e.fact AS fact,\\n        e.episodes AS episodes,\\n        e.expired_at AS expired_at,\\n        e.valid_at AS valid_at,\\n        e.invalid_at AS invalid_at,\\n    properties(e) AS attributes\\n            ORDER BY score DESC\\n            LIMIT $limit\\n            '\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `fact_embedding` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=4, column=63, offset=120>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 120, 'line': 4, 'column': 63}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (n:Entity)-[e:RELATES_TO]->(m:Entity)\\n    \\n            WITH DISTINCT e, n, m, vector.similarity.cosine(e.fact_embedding, $search_vector) AS score\\n            WHERE score > $min_score\\n            RETURN\\n            \\n        e.uuid AS uuid,\\n        n.uuid AS source_node_uuid,\\n        m.uuid AS target_node_uuid,\\n        e.group_id AS group_id,\\n        e.created_at AS created_at,\\n        e.name AS name,\\n        e.fact AS fact,\\n        e.episodes AS episodes,\\n        e.expired_at AS expired_at,\\n        e.valid_at AS valid_at,\\n        e.invalid_at AS invalid_at,\\n    properties(e) AS attributes\\n            ORDER BY score DESC\\n            LIMIT $limit\\n            '\n",
            "WARNING:neo4j.notifications:Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `episodes` does not exist in database `neo4j`. Verify that the spelling is correct.', position=<SummaryInputPosition line=15, column=11, offset=452>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 452, 'line': 15, 'column': 11}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (n:Entity)-[e:RELATES_TO]->(m:Entity)\\n    \\n            WITH DISTINCT e, n, m, vector.similarity.cosine(e.fact_embedding, $search_vector) AS score\\n            WHERE score > $min_score\\n            RETURN\\n            \\n        e.uuid AS uuid,\\n        n.uuid AS source_node_uuid,\\n        m.uuid AS target_node_uuid,\\n        e.group_id AS group_id,\\n        e.created_at AS created_at,\\n        e.name AS name,\\n        e.fact AS fact,\\n        e.episodes AS episodes,\\n        e.expired_at AS expired_at,\\n        e.valid_at AS valid_at,\\n        e.invalid_at AS invalid_at,\\n    properties(e) AS attributes\\n            ORDER BY score DESC\\n            LIMIT $limit\\n            '\n"
          ]
        },
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Added episode About Me\n",
            "Added episode About my Knowledge Graphs\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "episodes = [\n",
        "    {\n",
        "        \"name\": \"About AI Projects\",\n",
        "        \"content\": \"I am behind a few AI Projects\",\n",
        "        \"type\": EpisodeType.text,\n",
        "        \"description\": \"overview\",\n",
        "    },\n",
        "    {\n",
        "        \"name\": \"AI Projects\",\n",
        "        \"content\": {\n",
        "            'product': 'Shreyas Agent',\n",
        "            'company': 'Shreyas Company',\n",
        "            'website': 'lovable portfolio'\n",
        "        },\n",
        "        \"type\": EpisodeType.json,\n",
        "        \"description\": \"project metadata\",\n",
        "    }\n",
        "]"
      ],
      "metadata": {
        "id": "vh-UdFU1NLVP"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "await add_data(episodes)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "38aHapHrQoNX",
        "outputId": "5238b55e-578a-4621-ec9c-21073f18c47e"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Added episode About AI Projects\n",
            "Added episode AI Projects\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [
        "# Perform a Hybrid Search combining semantic similarity and BM25 retrieval\n",
        "\n",
        "query = \"What products does AI Projects have?\"\n",
        "results = await graphiti.search(query=query, num_results=1)"
      ],
      "metadata": {
        "id": "6y_3J8_IQySC"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "def print_results(results):\n",
        "  \"\"\"Print the results of a search query.\"\"\"\n",
        "  print('\\nSearch Results:')\n",
        "  for result in results:\n",
        "    print(f\"UUID: {result.uuid}\")\n",
        "    print(f\"Fact: {result.fact}\")\n",
        "    if hasattr(result, 'valid_at') and result.valid_at:\n",
        "      print(f\"Valid from: {result.valid_at}\")\n",
        "    if hasattr(result, 'invalid_at') and result.invalid_at:\n",
        "      print(f\"Valid until: {result.invalid_at}\")\n",
        "    print('---')"
      ],
      "metadata": {
        "id": "NOO6SeBkSdxd"
      },
      "execution_count": null,
      "outputs": []
    },
    {
      "cell_type": "code",
      "source": [
        "print_results(results)"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "c-lrhEoZTTd-",
        "outputId": "f951a2c5-e2c8-4e8c-d64b-eda5917a23b0"
      },
      "execution_count": null,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "\n",
            "Search Results:\n",
            "UUID: 7b66b2a3-cb07-43c6-994b-450dd660aab8\n",
            "Fact: I is behind a few AI Projects\n",
            "Valid from: 2025-11-06 17:42:21.220805+00:00\n",
            "Valid until: 2025-11-06 17:42:43.085685+00:00\n",
            "---\n"
          ]
        }
      ]
    },
    {
      "cell_type": "code",
      "source": [],
      "metadata": {
        "id": "c8DrKopZTasc"
      },
      "execution_count": null,
      "outputs": []
    }
  ]
}